IDEA StatiCa Open Model
LineSegment3D Constructor
Compatible with IDEA StatiCa Beta 21.0 - beta
Initializes a new instance of the LineSegment3D class
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public LineSegment3D()
Public Sub New
public:
LineSegment3D()
See Also
Reference
LineSegment3D Class
IdeaRS.OpenModel.Geometry3D Namespace